---
type: IPointCloudEngine
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 2
tags: [revit-api, class]
---

# IPointCloudEngine

`Autodesk.Revit.DB.PointClouds.IPointCloudEngine` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreatePointCloudAccess | 2012 | `IPointCloudAccess CreatePointCloudAccess ( string identifier )` |
| Method | Free | 2012 | `void Free ()` |